class script(object):

    START_TXT = """<b>ʜᴇʟʟᴏ {}!\n\nɪ ᴀᴍ ᴀ ᴘᴏᴡᴇʀꜰᴜʟʟ ғɪʟᴇ ᴛᴏ + sʜᴏʀᴛɴᴇʀ ʟɪɴᴋ ʙᴏᴛ ɪɴ 4ɢʙ

ᴡᴏʀᴋɪɴɢ ғᴏʀ ᴛʜɪs ɢʀᴏᴜᴘ ᴏɴʟʏ  !!
ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴇʟᴏᴡ ʙᴜᴛᴛᴏɴ ᴛᴏ ᴊᴏɪɴ👇
    
ᴍᴀɴᴛᴀɪɴᴇᴅ ʙʏ : <a href=https://t.me/Hari_OP>ʜᴀʀɪ ᠰ ᴛɢ​</a> </b>"""

    ABOUT_TXT = """<b>🤖 ᴍʏ ɴᴀᴍᴇ : ғᴀsᴛ ᴅᴏᴡɴʟᴏᴀᴅ ʟɪɴᴋ ʙᴏᴛ
👨‍💻 ᴅᴇᴠᴇʟᴏᴘᴇʀ : ʜᴀʀɪ
📝 ʟᴀɴɢᴜᴀɢᴇ : ᴘʏʀᴏɢʀᴀᴍ
📚 ꜰʀᴀᴍᴇᴡᴏʀᴋ : ᴘʏᴛʜᴏɴ 3
📡 ʜᴏsᴛᴇᴅ ᴏɴ : ᴠᴘs
🌟 ᴠᴇʀsɪᴏɴ : ᴠ 13.0 [ ʙᴇᴛᴀ ]</b>"""
    
    
    HELP_TXT = """<b>⊹ ʜᴏᴡ ᴛᴏ ᴜsᴇ ғɪʟᴇs ᴛᴏ ʟɪɴᴋ ʙᴏᴛ ⊹</b>

⇒ <code>sᴇɴᴅ ᴍᴇ ᴀɴʏ ғɪʟᴇ (ᴏʀ) ᴍᴇᴅɪᴀ ғʀᴏᴍ ᴛᴇʟᴇɢʀᴀᴍ..</code>

⇒ <code>ᴛʜɪs ʙᴏᴛ ᴡɪʟʟ sᴇɴᴅ ʏᴏᴜ ᴘᴇʀᴍᴀɴᴇɴᴛ ʟɪɴᴋ</code>

⇒ <code>ᴛʜɪs ʟɪɴᴋ ᴄᴀɴ ʙᴇ ᴜsᴇᴅ ᴛᴏ ᴅᴏᴡɴʟᴏᴀᴅ ᴏʀ sᴛʀᴇᴀᴍ ғɪʟᴇs[ᴜsɪɴɢ ᴇxᴛᴇʀɴᴀʟ ᴠɪᴅᴇᴏ ᴘʟᴀʏᴇʀ] ᴛʜʀᴏᴜɢʜ ᴍʏ sᴇʀᴠᴇʀ</code>

⇒ <code>ғᴏʀ sᴛʀᴇᴀᴍɪɴɢ ᴊᴜsᴛ ᴄᴏᴘʏ ᴛʜᴇ ᴍᴏɴᴏ ʟɪɴᴋ ᴀɴᴅ ᴘᴀsᴛᴇ ɪᴛ ɪɴ ʏᴏᴜʀ ᴠɪᴅᴇᴏ ᴘʟᴀʏᴇʀ ᴛᴏ sᴛᴀʀᴛ sᴛʀᴇᴀᴍɪɴɢ</code>

⇒ <code>ᴛʜɪs ʙᴏᴛ sʜᴀʀᴇs ᴛʜᴇ ᴘᴇʀᴍᴀɴᴇɴᴛ ʟɪɴᴋ ᴛᴏ ʏᴏᴜ.</code>

⇒ <code>ᴛʜɪs ʙᴏᴛ ɪs ᴀʟsᴏ sᴜᴘᴘᴏʀᴛᴇᴅ ɪɴ ᴄʜᴀɴɴᴇʟs. ᴀᴅᴅ ᴍᴇ ᴛᴏ ᴄʜᴀɴɴᴇʟ ᴀs ᴀᴅᴍɪɴ ᴛᴏ ᴍᴀᴋᴇ ᴍᴇ ᴡᴏʀᴋᴀʙʟᴇ...!</code>

⇒ <code>ʜᴏᴡ ᴛᴏ ᴀᴅᴅ sʜᴏʀᴛɴᴇʀ-ʟɪɴᴋ</code> -<b>/comments</b>

⇒ <code>ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏʀᴍᴀᴛɪᴏɴ</code> :<b> <a href=https://t.me/Hs_Botz>ʜꜱ ᠰ ʙᴏᴛꜱ</a></b>

⚠️ <b><u>ᴡᴀʀɴɪɴɢ</u></b>

<code>ᴅᴏ ɴᴏᴛ ᴏᴠᴇʀʟᴏᴀᴅ ᴛʜᴇ ʙᴏᴛ
ɪꜰ ʙᴏᴛ ɴᴏᴛ ᴡᴏʀᴋɪɴɢ ᴀɴᴅ ɪssᴜᴇs</code>

<b>ᴄᴏɴᴛᴀᴄᴛ - <a href=https://t.me/Hari_OP>♚ ᴏᴡɴᴇʀ ♚</a></b>"""

    
    COMMENTS_TXT = """<b><u> ⊹ ʜᴏᴡ ᴛᴏ ᴄᴏɴɴᴇᴄᴛ ʏᴏᴜʀ ᴏᴡɴ sʜᴏʀᴛɴᴇʀ ⊹</u>
    
1. /shortner_url
2. /shortner_api
3. /set_caption
4. /see_caption
5. /del_caption</b>

ᴇxᴀᴍᴘʟᴇ ↓↓↓

`/shortner_url v2.kpslink.in`

`/shortner_api ec8ba7deff6128848def53bf2d4e69608443cf27`

<code>ɪꜰ ʙᴏᴛ ɴᴏᴛ ᴡᴏʀᴋɪɴɢ ᴀɴᴅ ɪssᴜᴇs 
ᴄᴏɴᴛᴀᴄᴛ</code> - <a href=https://t.me/Hari_OP>♚ ᴏᴡɴᴇʀ ♚</a>

<b>⚡ᴩᴏᴡᴇʀᴇᴅ ʙʏ - <a href=https://t.me/Hs_Botz>ʜꜱ ᠰ ʙᴏᴛꜱ</a></b>"""
    
    STATUS_TXT = """<b>
👤 ᴛᴏᴛᴀʟ ᴜsᴇʀs: <code>{}</code>
📢 ᴛᴏᴛᴀʟ ɢʀᴏᴜᴘs : <code>{}</code></b>"""
